In [4]:
%matplotlib inline
import pandas as pd
from google.colab import files
data_to_load = files.upload()

In [6]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [28]:
cast=pd.read_csv('/content/drive/My Drive/data/Copy of cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [29]:
dates=pd.read_csv('/content/drive/My Drive/data/Copy of release_dates.csv')
dates.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [8]:
titles = pd.read_csv('/content/drive/My Drive/data/Copy of titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [12]:
titles['title'].nunique()

223828

### What are the earliest two films listed in the titles dataframe?

In [17]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [18]:
titles['title'].value_counts().head(1)

Hamlet    20
Name: title, dtype: int64

### How many movies are titled "North by Northwest"?

In [19]:
len(titles[titles['title']=="North by Northwest"])
#data frame is soretd

1

### When was the first movie titled "Hamlet" made?

In [20]:
titles[titles['title']=='Hamlet'].head(1)

       title  year
6422  Hamlet  2017

### List all of the "Treasure Island" movies from earliest to most recent.

In [16]:
titles[titles['title']== "Treasure Island" ]

                  title  year
27076   Treasure Island  1999
37238   Treasure Island  1973
55686   Treasure Island  1918
65051   Treasure Island  1972
77354   Treasure Island  1950
141822  Treasure Island  1934
173051  Treasure Island  1985
196514  Treasure Island  1920

### How many movies were made in the year 1950?

In [23]:
len(titles[titles['year']==1950])

1113

### How many movies were made in the year 1960?

In [22]:
len(titles[titles['year']==1960])

1549

### How many movies were made from 1950 through 1959?

In [21]:
j=titles[titles['year']>=1950]
len(j[j['year']<=1959])

12934

### In what years has a movie titled "Batman" been released?

In [24]:
titles[titles['title']=='Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [30]:
cast[cast['title']=='Inception'].nunique()[4]

56

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [31]:
d=cast[cast['title']=='Inception']
d['n'].isnull().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [ ]:

len(cast[cast['title']=='Inception'])-d['n'].isnull().sum()

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [32]:
m=cast.dropna()
m[m['title']== "North by Northwest"].sort_values('n')

                      title  year  ...                    character     n
871426   North by Northwest  1959  ...           Roger O. Thornhill   1.0
3518333  North by Northwest  1959  ...                  Eve Kendall   2.0
1457165  North by Northwest  1959  ...              Phillip Vandamm   3.0
3157232  North by Northwest  1959  ...              Clara Thornhill   4.0
356707   North by Northwest  1959  ...                The Professor   5.0
3048272  North by Northwest  1959  ...                Mrs. Townsend   6.0
1695173  North by Northwest  1959  ...              Lester Townsend   7.0
1275337  North by Northwest  1959  ...                      Leonard   8.0
2447081  North by Northwest  1959  ...                     Valerian   9.0
1811387  North by Northwest  1959  ...              Victor Larrabee  10.0
665768   North by Northwest  1959  ...                        Licht  11.0
2295714  North by Northwest  1959  ...                   Auctioneer  12.0
464736   North by Northwest  1959  ...                    Dr. Cross  13.0
1508344  North by Northwest  1959  ...               Sergeant Flamm  14.0
206471   North by Northwest  1959  ...               Captain Junket  15.0
1384780  North by Northwest  1959  ...  Charley - Chicago Policeman  16.0

[16 rows x 6 columns]

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [35]:
m=cast[cast['title']=='Sleuth']
m[m['year']==1972].sort_values('n')

          title  year  ...                   character    n
1705394  Sleuth  1972  ...                 Andrew Wyke  1.0
326773   Sleuth  1972  ...                 Milo Tindle  2.0
373876   Sleuth  1972  ...           Inspector Doppler  3.0
1465483  Sleuth  1972  ...  Detective Sergeant Tarrant  4.0
2724553  Sleuth  1972  ...             Marguerite Wyke  5.0
1448690  Sleuth  1972  ...      Police Constable Higgs  6.0

[6 rows x 6 columns]

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [34]:
f=cast[cast['title']=='Sleuth']
f[f['year']==2007].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [36]:
h=cast[cast['year']==1921]
h[h['title']=='Hamlet'].nunique()[4]

9

### How many roles were credited in Branaghs 1996 Hamlet?

In [49]:

g=cast[cast['year']==1996]

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

In [48]:
len(cast[cast['character']=='Ophelia'])

117

### How many people have played a role called "The Dude"?

In [47]:
len(cast[cast['character']=="The Dude"])

19

### How many people have played a role called "The Stranger"?

In [46]:
len(cast[cast['character']=="The Stranger"])

212

### How many roles has Sidney Poitier played throughout his career?

In [45]:
len(cast[cast['name']=='Sidney poitier'])

0

### How many roles has Judi Dench played?

In [43]:
len(cast[cast['name']=='Judi Dench'])

55

In [44]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [42]:
k=cast[cast['n']==2]
l=k[k['name']=='Cary Grant']
h=l[l['year']==1940].sort_values('year')
h

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [41]:
k=cast[cast['type']=='actor']
l=k[k['name']=='Cary Grant']
h=l[l['year']==1940].sort_values('year')
h

                          title  year  ...           character    n
871407          His Girl Friday  1940  ...        Walter Burns  1.0
871423         My Favorite Wife  1940  ...          Nick Arden  2.0
871448  The Howards of Virginia  1940  ...         Matt Howard  1.0
871450   The Philadelphia Story  1940  ...  C. K. Dexter Haven  1.0

[4 rows x 6 columns]

### How many roles were available for actors in the 1950s?

In [40]:
k=cast[cast['type']=='actor']
l=k[k['year']==1950].nunique()
l[4]

11266

### How many roles were available for actresses in the 1950s?

In [39]:

k=cast[cast['type']=='actresses']
l=k[k['year']==1950].nunique()
l[4]

0

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [38]:
k=cast[cast['n']==1]
l=k[k['year']<=1980]
l.nunique()[3]

2

### How many non-leading roles were available through from the beginning of film history through 1980?

In [37]:
k=cast[cast['n']!=1]
l=k[k['year']<=1980]
s=l.nunique()[3]
s-2

0

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?